CSI API ETABS v1
cGenDispl.SetTypeOAPI Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetTypeOAPI(
	string Name,
	int MyType
)
Function SetTypeOAPI (
	Name As String,
	MyType As Integer
) As Integer
Dim instance As cGenDispl
Dim Name As String
Dim MyType As Integer
Dim returnValue As Integer
returnValue = instance.SetTypeOAPI(Name,
	MyType)
int SetTypeOAPI(
	String^ Name,
	int MyType
)
abstract SetTypeOAPI :
        Name : string *
        MyType : int -> int
Parameters
Name
Type: System.String
MyType
Type: System.Int32
Return Value
Type: Int32
See Also
Reference
cGenDispl Interface
ETABSv1 Namespace